src/Catalogs/ВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ВнешниеСистемы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторизацияПоКодуБезСМС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Используется</Name>
					<Comment>Внешняя система используется</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючПриложения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрования</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КлючШифрованияОбратногоЗвонка</Name>
					<Comment>Используется для обратного звонка в CRM</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Синхронизирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТокенДоступа</Name>
					<Comment>Используется для отправки Push уведомлений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УправлениеВЛичномКабинете</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ЭквайринговыеТерминалы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ЭквайринговыеТерминалы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЛицевогоСчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЛицевыхСчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОплатуПоСсылке</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерДоговора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыПлатежногоШлюза</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодключаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентКомиссии</Name>
					<Comment>Процент комиссии</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипБанка</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПлатежныеШлюзы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипФискализации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыФискализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭквайринга</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭквайринговыхТерминалов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Шаблон</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Эквайер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйСервер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/Кассы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>Кассы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвтоматическоеСписаниеМатериалов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвтСдачаВыемкиПриЗакрытииСмены</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлокироватьПечатьЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияФФДдляККТ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнешнееОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодключаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыемкаИзКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗавершатьАвтоматическиОперацииВемкиВнесения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьБезПодключенияОборудования</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассаДляСдачиВыручки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМКласс</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККММарка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМНомерПроизводителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМНомерРегистрационный</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ККМТип</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПередаватьДолжность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьКопииЧеков</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьКопииЧековКоличество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеКассира</Name>
					<Comment>0 - "Фамилия Имя Отчество"1. "Фамилия Имя"2. "Фамилия И.О."3. "Фамилия И."4. "Фамилия"</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетЭлектронногоЧека</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипКассы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыКасс</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФорматТелефонногоНомераДляОтправкиЭлектронныхЧековККМ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭквайринговыйТерминал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйЧекEmailПередаютсяПрограммой1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектронныйЧекSMSПередаютсяПрограммой1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Секции</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СегментНоменклатуры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерСекции</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыОплат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПробиватьНефискальныйЧек</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеИспользовать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЭквайринговыеТерминалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭквайринговыйТерминал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЭквайринговыеТерминалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основной</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ВнешниеСистемы/Forms/ФормаЭлементаСистемаБыстрыхПлатежей/Ext/Form/Module.bsl
&НаСервере
// Процедура - При создании на сервере
//
// Параметры:
//  Отказ				 - 	 - 
//  СтандартнаяОбработка - 	 - 
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Объект.Ссылка.Пустая() Тогда
		Параметры.Свойство("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
		Объект.КлючПриложения = Новый УникальныйИдентификатор();
		СформироватьНаименование();
		Если ЗначениеЗаполнено(Объект.ТипВнешнейСистемы) Тогда
			Элементы.ТипВнешнейСистемы.Видимость = Ложь;
		Иначе
			Элементы.ТипВнешнейСистемы.Видимость = Истина;
		КонецЕсли;
		Элементы.ГруппаУдалить.Видимость 		 = Ложь;
	Иначе
		ПараметрыВнешнейСистемы = Объект.Ссылка.Параметры.Получить();		
		Элементы.ТипВнешнейСистемы.Видимость = Ложь;
	КонецЕсли;
	
	Если ПараметрыВнешнейСистемы <> Неопределено Тогда
		МассивСтруктурноЭквайринговыхСоответствий = ПолучитьЗначениеИзСтруктуры(ПараметрыВнешнейСистемы, "МассивСтруктурноЭквайринговыхСоответствий", Новый Массив);
		
		ЗаполнитьТЗСтруктурноЭкайринговыхСоответсвий(МассивСтруктурноЭквайринговыхСоответствий);
		ЗаполнитьСтруктурноЭкайринговыеСоответствия();
	КонецЕсли;
	
	ЭтотОбъект.Webhook = "https://cloud.stoma1c.ru/api/hs/api/sbp/" + Объект.КлючПриложения;
	
КонецПроцедуры

&НаСервере
// Процедура - Перед записью на сервере
//
// Параметры:
//  Отказ			 - 	 - 
//  ТекущийОбъект	 - 	 - 
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ПараметрыВнешнейСистемы = ТекущийОбъект.Параметры.Получить();
	
	Если ПараметрыВнешнейСистемы = Неопределено Тогда
		ПараметрыВнешнейСистемы = Новый Структура;
	КонецЕсли;
	
	// Удаляем пустые строки Структурных единиц
	Индекс = 0;
	Пока Индекс < ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Количество() Цикл
		
		СЭС = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия;
		
		Если Не ЗначениеЗаполнено(СЭС[Индекс].СтруктурнаяЕдиница) Тогда
			ИндексСтроки = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Индекс(СЭС[Индекс]);
			ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Удалить(ИндексСтроки);
			УдалитьДинамическиеЭлементыИПерезаполнитьСписок();
		Иначе
			Индекс = Индекс + 1;
		КонецЕсли;	
	КонецЦикла;
	
	//Если Не СтруктурноЭквайринговыеСоответсвияЗаполненыВерно() Тогда
	//	Отказ = Истина;
	//	Возврат;
	//КонецЕсли;
	
	ПараметрыВнешнейСистемы.Вставить("МассивСтруктурноЭквайринговыхСоответствий", ПолучитьМассивСтруктурноЭквайринговыеСоответствий());	
	
	ДобавитьРеквизитВСтруктуру(ПараметрыВнешнейСистемы, "Webhook", ЭтотОбъект.Webhook);
	
	ТекущийОбъект.Параметры = Новый ХранилищеЗначения(ПараметрыВнешнейСистемы);
	
КонецПроцедуры

&НаКлиенте
// Процедура - После записи
//
// Параметры:
//  ПараметрыЗаписи	 - 	 - 
//
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Оповестить("ЗаписанаВнешняяСистема", Новый Структура("ВнешняяСистема, ТипВнешнейСистемы", Объект.Ссылка, Объект.ТипВнешнейСистемы));
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПослеЗаписиНаСервере".
//
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьВнешнююСистему();
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ОбработкаОповещения".
//
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ЗаписанаВнешняяСистема" Тогда
		
		ЭтаФорма.Прочитать();
		Этаформа.ОбновитьОтображениеДанных();
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, формирует наименование.
//
Процедура СформироватьНаименование() 
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВнешниеСистемы.Наименование КАК Наименование
	|ИЗ
	|	Справочник.ВнешниеСистемы КАК ВнешниеСистемы
	|ГДЕ
	|	ВнешниеСистемы.ТипВнешнейСистемы = &ТипВнешнейСистемы");
	
	Запрос.УстановитьПараметр("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
	
	ТаблицаВнешнихСистем = Запрос.Выполнить().Выгрузить();
	
	Объект.Наименование = Строка(Объект.ТипВнешнейСистемы) + ?(ТаблицаВнешнихСистем.Количество() > 1, "-" + Строка(ТаблицаВнешнихСистем.Количество()), ""); 
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет реквизит в структуру.
//
Процедура ДобавитьРеквизитВСтруктуру(ПараметрыВнешнейСистемы, НаименованиеРеквизита, ЗначениеРеквизита)
	
	Если ПараметрыВнешнейСистемы.Свойство(НаименованиеРеквизита) Тогда
		ПараметрыВнешнейСистемы[НаименованиеРеквизита] = ЗначениеРеквизита;
	Иначе
		ПараметрыВнешнейСистемы.Вставить(НаименованиеРеквизита, ЗначениеРеквизита); 
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "СоздатьКлюч" 
//
Процедура СоздатьКлюч(Команда)
	
	Объект.КлючПриложения = Строка(Новый УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ЭквайринговыйТерминал_ДляКопированияПриИзменении(Элемент)
	
	ИндексСтрокиЭТ        = ПолучитьИндексНаименования(Элемент.Имя);
	ИндексСтрокиСЕ        = ПолучитьИндексНаименования(Элемент.Родитель.Родитель.Имя);
	
	ЭквайринговыйТерминал = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексСтрокиЭТ)].ЭквайринговыйТерминал;
	СтруктурнаяеЕдиница   = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексСтрокиСЕ)].СтруктурнаяЕдиница;             
	НайденныеСтроки       = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.НайтиСтроки(Новый Структура("ЭквайринговыйТерминал, СтруктурнаяЕдиница", ЭквайринговыйТерминал, СтруктурнаяеЕдиница));
	
	Если НайденныеСтроки.Количество() > 1  И ЗначениеЗаполнено(ЭквайринговыйТерминал) И ЗначениеЗаполнено(СтруктурнаяеЕдиница) Тогда		
		ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексСтрокиЭТ)].ЭквайринговыйТерминал = Неопределено;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru='Эквайринговый терминал: ""%1"" ,  уже добавлен для структурной единицы: ""%2""';en='Acquiring terminal: ""%1"" already added for structural unit: ""%2""'"), ЭквайринговыйТерминал, СтруктурнаяеЕдиница));
	ИначеЕсли ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
		Организация = ПолучитьЗначенияРеквизитовПоСсылке(ЭквайринговыйТерминал, "Организация");
		Элементы["ДекорацияОрганизация_" + ИндексСтрокиЭТ].Заголовок = Строка(Организация); 	
	КонецЕсли;	
	
	НайденныеСтрокиЭТ = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница", СтруктурнаяеЕдиница));
	КоличествоЭТ      = 0;
	Для Каждого СтрокаНС Из НайденныеСтрокиЭТ Цикл
		Если ЗначениеЗаполнено(СтрокаНС.ЭквайринговыйТерминал) Тогда
			КоличествоЭТ = КоличествоЭТ + 1;	
		КонецЕсли;
	КонецЦикла;	
	
	ДекорацияНажатие = Элементы.Найти("ДекорацияНажатиеЭквайриговыеТерминалы_" + ИндексСтрокиСЕ);
	ДекорацияНажатие.Заголовок = Нстр("ru = 'Эквайринговые терминалы('; en = 'Acquiring terminals('") + КоличествоЭТ + ")";
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура СтруктурнаяЕдиница_ДляКопированияПриИзменении(Элемент)
	
	ИндексСтроки       = ПолучитьИндексНаименования(Элемент.Имя);
	СтруктурнаяЕдиница = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексСтроки)].СтруктурнаяЕдиница;
	НайденныеСтроки    = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница", СтруктурнаяЕдиница));
	
	Если НайденныеСтроки.Количество() > 1 И значениеЗаполнено(СтруктурнаяЕдиница) Тогда		
		ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексСтроки)].СтруктурнаяЕдиница = Неопределено;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон(НСтр("ru='Структурная едница: ""%1"",  уже добавлена';en='Structural unit: ""%1"" already added'"), СтруктурнаяЕдиница));
	Иначе
		
		КлючСтроки = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексСтроки)].КлючСтроки;
		НайденныеСтроки = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.НайтиСтроки(Новый Структура("КлючСтроки", КлючСтроки));
		
		Для Каждого СтрокаНС Из НайденныеСтроки Цикл 
			СтрокаНС.СтруктурнаяЕдиница = СтруктурнаяЕдиница; 			
		КонецЦикла;	
		
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Функция, возвращает массив структурно эквайринговых соответствий.
//
Функция ПолучитьМассивСтруктурноЭквайринговыеСоответствий()
	
	МассивСЭС = Новый Массив;
	Для Каждого СтрокаТЧ ИЗ ЭтотОбъект.СтруктурноЭквайринговыеСоответствия Цикл 
		СтруктураСтроки = Новый Структура("СтруктурнаяЕдиница, ЭквайринговыйТерминал, КлючСтроки");
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТЧ);
		МассивСЭС.Добавить(СтруктураСтроки);
	КонецЦикла;	
	
	Возврат МассивСЭС;
	
КонецФункции	

&НаСервере
// Процедура, заполняет таблицу значений структурно эквайринговых соответствий.
//
Процедура ЗаполнитьТЗСтруктурноЭкайринговыхСоответсвий(МассивСЭС)
	
	Для Каждого ЭлементМ ИЗ МассивСЭС Цикл 
		НоваяСтрорка = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Добавить();
		НоваяСтрорка.СтруктурнаяЕдиница    = ЭлементМ.СтруктурнаяЕдиница;
		НоваяСтрорка.ЭквайринговыйТерминал = ЭлементМ.ЭквайринговыйТерминал;
		НоваяСтрорка.КлючСтроки            = ЭлементМ.КлючСтроки;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
// Процедура,обработчик команды "ДобавитьЭквайринговыйТерминал".
//
Процедура ДобавитьЭквайринговыйТерминал(Команда)
	
	ИндексГруппы = ПолучитьИндексНаименования(Команда.Имя);
	
	НоваяСтрока  = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Добавить();
	ИндексСтроки = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Индекс(НоваяСтрока);
	
	ДобавитьЭквайринговыйТерминалНаФорму(ИндексГруппы, ИндексСтроки);
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды "ДобавитьСтруктурнуюЕдиницу".
//
Процедура ДобавитьСтруктурнуюЕдиницу(Команда)
	
	НоваяСтрока  = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Добавить();
	НоваяСтрока.КлючСтроки = Новый УникальныйИдентификатор;
	
	ИндексСтроки = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Индекс(НоваяСтрока);
	ДобавитьСтруктурнуюЕдиницуНаФорму(ИндексСтроки, ИндексСтроки);
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет эквайринговый терминал на форму.
//
Процедура ДобавитьЭквайринговыйТерминалНаФорму(ИндексГруппы, ИндексТЧ, ПервичноеЗаполнение = Ложь)
	
	// Заполняем группу списка ЭТ
	ГруппаСписокЭТ = Элементы["ГруппаСписокЭквайринговыхТерминалов_" + Число(ИндексГруппы)];
	ГруппаЭТиО     = КопироватьГруппуФормы(Элементы.ГруппаЭквайринговыйТерминалОрганизация_ДляКопирования, ИндексТЧ, ГруппаСписокЭТ);
	
	// Заполняем группу ЭТ и О
	ПутьКДаннымЭТ            = "СтруктурноЭквайринговыеСоответствия[" + ИндексТЧ + "].ЭквайринговыйТерминал";	
	ЭлементЭТ                = КопироватьЭлементФормы(Элементы.ЭквайринговыйТерминал_ДляКопирования    , ИндексТЧ, ГруппаЭТиО, ПутьКДаннымЭТ);	
	ДекорацияОрганизация     = КопироватьЭлементФормы(Элементы.ДекорацияОрганизация_ДляКопирования     , ИндексТЧ, ГруппаЭТиО);
	ДекорацияУдалитьСтрокуЭТ = КопироватьЭлементФормы(Элементы.ДекорацияУдалитьСтрокуЭТ_ДляКопипрования, ИндексТЧ, ГруппаЭТиО);	
	
	Если Не ПервичноеЗаполнение Тогда
		
		СтруктурнаяЕдиница = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексГруппы)].СтруктурнаяЕдиница;
		ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексТЧ)].СтруктурнаяЕдиница = СтруктурнаяЕдиница;
		
		КлючСтроки = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексГруппы)].КлючСтроки;
		ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(ИндексТЧ)].КлючСтроки = КлючСтроки;
		
		ЭтаФорма.ТекущийЭлемент = ЭлементЭТ;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
// Процедура, добавляет структурную единицу на форму.
//
Процедура ДобавитьСтруктурнуюЕдиницуНаФорму(Индекс, ИндексСЕ, ПервичноеЗаполнение = Ложь)
	
	// Общая группа = ГруппаОбщаяДляСтруктурныхЕдиниц!!!
	ГруппаСтрокаСтруктурнойЕдиницы = КопироватьГруппуФормы(Элементы.ГруппаСтрокаСтруктурнойЕдиницы_ДляКопирпования, Индекс, Элементы.ГруппаОбщаяДляСтруктурныхЕдиниц);
	
	ПутьКДаннымСЕ 			  = "СтруктурноЭквайринговыеСоответствия[" + ИндексСЕ + "].СтруктурнаяЕдиница";
	ЭлементСтруктурнаяЕдиница = КопироватьЭлементФормы(Элементы.СтруктурнаяЕдиница_ДляКопирования, Индекс, ГруппаСтрокаСтруктурнойЕдиницы, ПутьКДаннымСЕ);
	
	ГруппаЭквайринговыхТерминаловВсплывающая = КопироватьГруппуФормы(Элементы.ГруппаЭквайринговыеТерминалыВсплывающая_ДляКопирования, Индекс, ГруппаСтрокаСтруктурнойЕдиницы);
	ГруппаОбщаяЭквайринговыеТерминалы 		 = КопироватьГруппуФормы(Элементы.ГруппаОбщаяЭквайринговыеТерминалы_ДляКопирования		, Индекс, ГруппаЭквайринговыхТерминаловВсплывающая);
	ДекорацияНажатияЭквайринговыеТерминалы 	 = КопироватьЭлементФормы(Элементы.ДекорацияНажатиеЭквайриговыеТерминалы_ДляКопирования	, Индекс, ГруппаСтрокаСтруктурнойЕдиницы);
	ДекорацияУдалитьСтрокуСЕ               	 = КопироватьЭлементФормы(Элементы.ДекорацияУдалитьСтрокуСЕ_ДляКопипрования            	, Индекс, ГруппаСтрокаСтруктурнойЕдиницы);
	
	// Заполняем общую группу эквайринговых терминалов
	ДекорацияЭквайринговыТерминалы = КопироватьЭлементФормы(Элементы.ДекорацияЭквайринговыйТерминалы_ДляКопирования		  , Индекс, ГруппаОбщаяЭквайринговыеТерминалы);
	ГруппаСписокЭТ     			   = КопироватьГруппуФормы(Элементы.ГруппаСписокЭквайринговыхТерминалов_ДляКопирования    , Индекс, ГруппаОбщаяЭквайринговыеТерминалы);
	ГруппаДобавленияЭТ 			   = КопироватьГруппуФормы(Элементы.ГруппаДобавлениеЭквайринговогоТерминала_ДляКопирования, Индекс, ГруппаОбщаяЭквайринговыеТерминалы);
	
	// Заполняем ГруппуДобавленияЭТ
	ДобавитьЭквайринговыйТерминал  = КопироватьКнопкуФормы(Элементы.ДобавитьЭквайринговыйТерминал_ДляКопирования, Индекс, ГруппаДобавленияЭТ);
	
	Если Не ПервичноеЗаполнение Тогда
		ДобавитьЭквайринговыйТерминалНаФорму(Индекс, Индекс);
		ЭтаФорма.ТекущийЭлемент = ЭлементСтруктурнаяЕдиница;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие".
//
Процедура ДекорацияУдалитьСтрокуСЕ_ДляКопипрованияНажатие(Элемент)	
	УдалитьДинамическийЭлемент(Элемент);
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие".
//
Процедура ДекорацияУдалитьСтрокуЭТ_ДляКопипрованияНажатие(Элемент)
	УдалитьДинамическийЭлемент(Элемент, Ложь);
КонецПроцедуры

&НаКлиенте
// Процедура, удаляет динамический элемент.
//
Процедура УдалитьДинамическийЭлемент(Элемент, СтрокаСЭ = Истина)
	
	Индекс                = ПолучитьИндексНаименования(Элемент.Имя);
	КлючСтроки            = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(Индекс)].КлючСтроки;
	ЭквайринговыйТерминал = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(Индекс)].ЭквайринговыйТерминал; 
	
	НайденныеСтроки = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.НайтиСтроки(Новый Структура("КлючСтроки", КлючСтроки));
	Если СтрокаСЭ Тогда	
		Для Каждого СтрокаНС Из НайденныеСтроки Цикл
			ИндексСтроки = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Индекс(СтрокаНС);
			ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Удалить(ИндексСтроки);
		КонецЦикла;		
	Иначе
		
		ИндексСтрокиСЕ = ПолучитьИндексНаименования(Элемент.Родитель.Родитель.Имя);
		Элементы["ГруппаЭквайринговыеТерминалыВсплывающая_" + Число(ИндексСтрокиСЕ)].Скрыть();
		
		Если НайденныеСтроки.Количество() = 1 Тогда
			ЭтотОбъект.СтруктурноЭквайринговыеСоответствия[Число(Индекс)].ЭквайринговыйТерминал = Неопределено;
		Иначе	
			Для Каждого СтрокаНС Из НайденныеСтроки Цикл
				Если СтрокаНС.ЭквайринговыйТерминал = ЭквайринговыйТерминал Тогда
					ИндексСтроки = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Индекс(СтрокаНС);
					ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Удалить(ИндексСтроки);
					Прервать;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	УдалитьДинамическиеЭлементыИПерезаполнитьСписок();	
	
КонецПроцедуры	

&НаСервере
// Процедура, удаляет перезаполняет список СЭС динамически на сервере.
//
Процедура УдалитьДинамическиеЭлементыИПерезаполнитьСписок()
	
	УправлениеИнтерфейсамиСервер.УдалитьПодчиненныеЭлементыГруппы(ЭтаФорма, Элементы.ГруппаОбщаяДляСтруктурныхЕдиниц, Неопределено);
	ЗаполнитьСтруктурноЭкайринговыеСоответствия();
	
КонецПроцедуры

&НаСервере
// Процедура, заполняе структурно эквайринговые соответствия.
//
Процедура ЗаполнитьСтруктурноЭкайринговыеСоответствия()
	
	МассивПроверреныхСЕ = Новый Массив;
	ТекущаяСЕ           = Неопределено;
	ИндексГруппы        = -1;
	ИндексТЧ            = 0;
	
	ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Сортировать("СтруктурнаяЕдиница");
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.СтруктурноЭквайринговыеСоответствия Цикл
		
		Если ТекущаяСЕ <> СтрокаТЧ.СтруктурнаяЕдиница ИЛИ ТекущаяСЕ = Неопределено Тогда
			
			ТекущаяСЕ = СтрокаТЧ.СтруктурнаяЕдиница;
			
			Если Не ЗначениеЗаполнено(ТекущаяСЕ) ИЛИ МассивПроверреныхСЕ.Найти(ТекущаяСЕ) <> Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			МассивПроверреныхСЕ.Добавить(ТекущаяСЕ);
			
			ИндексГруппы = ИндексГруппы + 1;
			ДобавитьСтруктурнуюЕдиницуНаФорму(ИндексГруппы, ИндексТЧ, Истина);
			
			НайденныеСтроки = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница", ТекущаяСЕ));
			
			Для Каждого НайденнаяСтрока ИЗ НайденныеСтроки Цикл
				
				ДобавитьЭквайринговыйТерминалНаФорму(ИндексГруппы, ИндексТЧ, Истина);
				
				// Организация эквайрингового тиерминала:
				Организация = ПолучитьЗначенияРеквизитовПоСсылке(НайденнаяСтрока.ЭквайринговыйТерминал, "Организация");
				Элементы["ДекорацияОрганизация_" + ИндексТЧ].Заголовок = Строка(Организация);
				
				ИндексТЧ = ИндексТЧ + 1;
				
			КонецЦикла;	
			
			// Количество эквайринговых терминалов:
			НайденныеСтрокиЭТ = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.НайтиСтроки(Новый Структура("СтруктурнаяЕдиница", ТекущаяСЕ));
			КоличествоЭТ      = 0;
			Для Каждого СтрокаНС Из НайденныеСтрокиЭТ Цикл
				Если ЗначениеЗаполнено(СтрокаНС.ЭквайринговыйТерминал) Тогда
					КоличествоЭТ = КоличествоЭТ + 1;	
				КонецЕсли;
			КонецЦикла;		
			УстановитьЗаголовЭТНаСервере(ИндексГруппы, КоличествоЭТ);
			
			// Продолжаем с текущеей позиции
			ИндексГруппы = ИндексТЧ - 1;
			
		КонецЕсли;
		
	КонецЦикла;	
	
КонецПроцедуры

&НаСервере
// Процедура - Установить заголов ЭТНа сервере
//
// Параметры:
//  ИндексСтрокиСЕ	 - 	 - 
//  КоличествоЭТ	 - 	 - 
//
Процедура УстановитьЗаголовЭТНаСервере(ИндексСтрокиСЕ, КоличествоЭТ)
	
	ДекорацияНажатие = Элементы.Найти("ДекорацияНажатиеЭквайриговыеТерминалы_" + ИндексСтрокиСЕ);
	ДекорацияНажатие.Заголовок = Нстр("ru = 'Эквайринговые терминалы('; en = 'Acquiring terminals('") + КоличествоЭТ + ")";
	
КонецПроцедуры

&НаКлиенте
// Процедура, обработчик события "Нажатие".
//
Процедура ДекорацияЭквайриговыеТерминалы_ДляКопированияНажатие(Элемент)
	
	Индекс = ПолучитьИндексНаименования(Элемент.Имя);
	Элементы["ГруппаЭквайринговыеТерминалыВсплывающая_" + Число(Индекс)].Показать();
	
КонецПроцедуры

&НаСервере
// Функция,  возвращает результат создания группы формы.
//
Функция КопироватьГруппуФормы(ГруппаИсточник, ПрефиксИмениНовойГруппы, Родитель)
	Возврат УправлениеИнтерфейсамиСервер.КопироватьГруппуФормы(ЭтаФорма, ГруппаИсточник, ПрефиксИмениНовойГруппы, Родитель);	
КонецФункции

&НаСервере
// Функция, возвращает результат создания кнопки формы.
//
Функция КопироватьКнопкуФормы(КнопкаИсточник, ПрефиксИмениНовойКнопки, Родитель)
	Возврат УправлениеИнтерфейсамиСервер.КопироватьКнопкуФормы(ЭтаФорма, КнопкаИсточник, ПрефиксИмениНовойКнопки, Родитель);
КонецФункции

&НаСервере
// Функция, возвращает результат создания элемента формы.
//
Функция КопироватьЭлементФормы(ЭлементИсточник, ПрефиксИмениНовогоЭлемента, Родитель, ПутьКДанным = Неопределено)
	Возврат УправлениеИнтерфейсамиСервер.КопироватьЭлементФормы(ЭтаФорма, ЭлементИсточник, ПрефиксИмениНовогоЭлемента,, Родитель, ПутьКДанным);	
КонецФункции

&НаКлиенте
// Функция, возвращает индекс элемента по его наименованию.
//
Функция ПолучитьИндексНаименования(НаименованиеЭлемента)
	
	НачалоИндекса = СтрНайти(НаименованиеЭлемента, "_", НаправлениеПоиска.СКонца);
	Возврат Сред(НаименованиеЭлемента, НачалоИндекса + 1);
	
КонецФункции

&НаСервере
// Процедура,  осуществляет проверку заполнения структурно эквайринговых соответсвий.
//
Функция СтруктурноЭквайринговыеСоответсвияЗаполненыВерно()
	
	Если Не ЗначениеЗаполнено(ЭтотОбъект.СтруктурноЭквайринговыеСоответствия) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить хотя бы одно структурно-эквайринговое соответствие");
		Возврат Ложь;
	КонецЕсли;
	
	МассивСтрок = ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.НайтиСтроки(Новый Структура("ЭквайринговыйТерминал", Справочники.ЭквайринговыеТерминалы.ПустаяСсылка()));
	
	Для Каждого НайденнаяСтрока Из МассивСтрок Цикл
		ЭтотОбъект.СтруктурноЭквайринговыеСоответствия.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	Для Каждого СтрокаТЧ Из ЭтотОбъект.СтруктурноЭквайринговыеСоответствия Цикл
		
		СтруктурнаяЕдиница	  = СтрокаТЧ.СтруктурнаяЕдиница;
		ЭквайринговыйТерминал = СтрокаТЧ.ЭквайринговыйТерминал;
		
		Если Не ЗначениеЗаполнено(СтруктурнаяЕдиница) Тогда
			Продолжить;
			
		ИначеЕсли Не ЗначениеЗаполнено(ЭквайринговыйТерминал) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='Для структурной единицы: %1 не указан ни один эквайринговый терминал';en='For structural unit: %1 is not specified any one acquiring terminal'"), СокрЛП(СтруктурнаяЕдиница));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
		
		КассаОплаты = Справочники.Кассы.ПолучитьКассуОплатыИПараметрыФискализации(ЭквайринговыйТерминал);
		
		Если Не ЗначениеЗаполнено(КассаОплаты) Тогда
			ТекстСообщения = СтрШаблон(НСтр("ru='К эквайринговому терминалу %1 не привязана касса оплаты';en='The payment cashier is not tied to the acquiring terminal %1'"), СокрЛП(ЭквайринговыйТерминал));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
			Возврат Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
// Функция, возвращает значение из структуры по ключу.
//
Функция ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию = Неопределено)
	
	Возврат ОбщегоНазначенияКлиентСервер.ПолучитьЗначениеИзСтруктуры(Структура, Ключ, ЗначениеПоУмолчанию);
	
КонецФункции

&НаСервере
// Процедура, обновляет внешнюю систему в crm.
//
Процедура ОбновитьВнешнююСистему()
	
	РезультатЗапроса = ЛичныйКабинет.ОбновитьВнешнююСистемуВ_CRM(Объект.Ссылка, Истина, ЛичныйКабинет.УидТекущейСессии());
	
	Если НЕ РезультатЗапроса.ВыполненоУспешно Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(РезультатЗапроса.ОписаниеОшибки + "(" + РезультатЗапроса.КодОшибки + ")");
		
		Если Объект.Ссылка.Пустая() Тогда
			Объект.Используется = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
// Процедура, копирует URL.
//
Процедура СкопироватьURL(Команда)
	
	ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(ЭтотОбъект.Webhook);	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Скопировано';en='Copied'"));
	
КонецПроцедуры

&НаКлиенте
// Процедура обработчик коменты: Удалить, Помечает на удаление текущую внешнюю систему
//
Процедура УдалитьИЗакрыть(Команда)
	
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияВопроса", ЭтотОбъект);	
	
	ПоказатьВопрос(Оповещение, "Вы точно хотите пометить на удаление данный элемент справочника?", РежимДиалогаВопрос.ДаНетОтмена, 0, КодВозвратаДиалога.Да);    
	
КонецПроцедуры

&НаКлиенте
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Да Тогда
		
		ПометитьНаУдаление();
		
		ПараметрыОповещения = Новый Структура;
		ПараметрыОповещения.Вставить("ВнешняяСистема"	, Объект.Ссылка);
		ПараметрыОповещения.Вставить("ТипВнешнейСистемы", Объект.ТипВнешнейСистемы);
		
		Оповестить("УдаленаВнешняяСистема", ПараметрыОповещения);
		
		ЭтаФорма.Закрыть();
	КонецЕсли;	
	
КонецПроцедуры 

&НаСервере
// Процедура, помечает внешнюю систему на удаление или снимает пометку.
//
Процедура ПометитьНаУдаление()
	
	ВнешняяСистемаОбъект = Объект.Ссылка.ПолучитьОбъект();
	ВнешняяСистемаОбъект.ПометкаУдаления = Истина;
	ВнешняяСистемаОбъект.Используется = Ложь;
	
	Попытка
		ВнешняяСистемаОбъект.Записать();
	Исключение 
	КонецПопытки;
	
КонецПроцедуры
